# Automobile Analysis

In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv("Automobile_data.csv")

In [4]:
df.head(3)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0

In [11]:
df.drop("index",axis=1,inplace=True)

## Question 1

In [43]:
# what is the average price and average mileage for convertible cars.
df.groupby("body-style")["price"].mean().loc["convertible"] #part 1

22341.0

In [44]:
df.groupby("body-style")["average-mileage"].mean().reset_index().iloc[0:1,:] #part 2

    body-style  average-mileage
0  convertible        19.666667

## Question 2

In [28]:
# Sort cars by company and price in decending order.
df.sort_values(by=["company","price"],ascending=False)

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
60,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0
59,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
58,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
57,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
56,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
...,...,...,...,...,...,...,...,...,...
5,audi,sedan,99.8,177.3,ohc,five,110,19,15250.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0

## Question 3

In [33]:
# Save data for 'Toyota' separately
toyota_data=df[df["company"]=="toyota"]
toyota_data.to_excel("toyota_data.xlsx",index=False)

## Question 4

In [40]:
# which company is producing most expensive car?
df.groupby("company")["price"].max().idxmax()

'mercedes-benz'

## Question 5

In [53]:
# name the cars on basis of maximum length, highest wheelbase, maximum horsepower
df.groupby("company")["length"].max().reset_index().sort_values(by="length",ascending=False).iloc[0:1] #part 1

         company  length
9  mercedes-benz   208.1

In [70]:
df.groupby("company")["wheel-base"].max().idxmax() #part 2

'mercedes-benz'

In [69]:
df[df["horsepower"]==df.groupby("company")["horsepower"].max().max()]["company"] #part 3

47    porsche
Name: company, dtype: object

## Question 6

In [77]:
# company wise average price of cars and order them in decending order
df.groupby("company")["price"].mean().reset_index().sort_values(by="price",ascending=False)

          company         price
12        porsche  35528.000000
9   mercedes-benz  35040.000000
7          jaguar  34600.000000
2             bmw  27213.333333
1            audi  16392.500000
0     alfa-romero  15498.333333
15          volvo  13177.500000
5           honda  10195.000000
8           mazda   9654.800000
14     volkswagen   8435.000000
11         nissan   8289.000000
13         toyota   8216.857143
6           isuzu   6785.000000
10     mitsubishi   6689.000000
4           dodge   6303.000000
3       chevrolet   6007.000000

## Question 7

In [91]:
# create a column named: "decision", If wheel-base is less than 100 and length is less than 175 then "don't buy" else "buy"
# def buy_decision(wheel_base,length):
#     if wheel_base<100 and length<175:
#         return "don't buy"
#     else:
#         return "buy"

# df["decision"]=df[["wheel-base","length"]].apply(buy_decision)
df["truth_values"]=(df["wheel-base"]<175) & (df["length"]<175)
def buy_decision(val):
    if val:
        return "buy"
    else:
        return "don't buy"
    
df["decision"]=df["truth_values"].apply(buy_decision)

In [93]:
df.sample(5)

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price,truth_values,decision
49,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0,True,buy
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0,False,don't buy
42,nissan,sedan,94.5,165.3,ohc,four,69,31,6849.0,True,buy
23,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN,True,buy
56,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0,True,buy

## Question 8

In [95]:
# Select only cars whose decision is "buy"; find average price based on company of car
df[df["decision"]=="buy"].groupby("company")["price"].mean().reset_index()

        company         price
0   alfa-romero  15498.333333
1     chevrolet   6007.000000
2         dodge   6303.000000
3         honda   8820.000000
4         isuzu   6785.000000
5         mazda   7482.500000
6    mitsubishi   6689.000000
7        nissan   6986.500000
8       porsche  35528.000000
9        toyota   6961.333333
10   volkswagen   8435.000000